---
kind: type
id: T:Autodesk.Revit.DB.BIMExportOptions
source: html/2e854291-02f8-e0c5-3b40-efe4da8a639a.htm
---
# Autodesk.Revit.DB.BIMExportOptions

The base class for options used to export using ATF.

## Syntax (C#)
```csharp
public class BIMExportOptions : IDisposable
```